/**
 * Created by Airma on 2016/11/1.
 */


// 查询分页数据
Mock.mock(/95cg\/api\/dpi_res\/list/, 'post', {
	draw: 1,
	dataTotal: 100,
	'list|15': [{
		'id|0-10000': 1,
		'resourceStatus|1': [0, 1, 2],
		'resourceIpHeader': /^([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])$/,
		'resourceIpStart': /^([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])$/,
		'resourceIpEnd': /^([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])$/,
		// 'resourceIp': /^([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\-([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])$/,
		'resourceEntryDate': '@date',
		'remark': '新增资源新增资源新增资源新增资源新增资源新增资源新增资源新增资源新增资源新增资源新增资源',
	}]
})

// 查询分页过滤数据
Mock.mock(/95cg\/api\/dpi_res\/filter/, 'post', {
	draw: 1,
	dataTotal: 100,
	'list|15': [{
		'id|0-10000': 1,
		'resourceStatus|1': [0, 1, 2],
		'resourceIpHeader': /^([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])$/,
		'resourceIpStart': /^([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])$/,
		'resourceIpEnd': /^([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])$/,
		// 'resourceIp': /^([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\-([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])$/,
		'resourceEntryDate': '@date',
		'remark': '新增资源新增资源新增资源新增资源新增资源新增资源新增资源新增资源新增资源新增资源新增资源',
	}]
});

// 新增数据
Mock.mock(/95cg\/api\/dpi_res\/add/, 'post', {
	data: 'createSuccess'
});

// 删除数据
Mock.mock(/95cg\/api\/dpi_res\/\d{1,10}/, 'delete', {
	data: ''
});

// 更新数据
Mock.mock(/95cg\/api\/dpi_res\/\d{1,10}/, 'put', {
	data: ''
});

Mock.mock(/95cg\/api\/dpi_res\/free\/list/, 'post', {
	draw: 1,
	dataTotal: 100,
	'list|15': [{
		'id|0-10000': 1,
		'resourceStatus|1': [0, 1, 2],
		'resourceIpHeader': /^([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])$/,
		'resourceIpStart': /^([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])$/,
		'resourceIpEnd': /^([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])$/,
		// 'resourceIp': /^([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\-([0-9]|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])$/,
		'resourceEntryDate': '@date',
		'remark': '新增资源新增资源新增资源新增资源新增资源新增资源新增资源新增资源新增资源新增资源新增资源',
	}]
})